<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CoursesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $description = '<h3>Обучение в очно-заочной группе начинается с Вводного курса.</h3>
        <p>Данный курс входит в стоимость 1 семестра и включает в себя решение следующих задач:<br>
        - знакомство с преподавателями;<br>
        - понимание нашего мировоззрения и соотнесение со своим;<br>
        - интересный и необходимый обучающий материал для вхождения в профессию;<br>
        - ваше понимание по усвоению материала (после лекции есть ли интерес слушать дальше, понятна ли информация, осталось ли что то из услышанного внутри...)</p>
        <p>К вводному курсу можно приступить прямо сейчас. Помимо лекций, он включает в себя 2 онлайн вебинара</p>

        <h3>Старт обучения с онлайн блока</h3>
        <p>Вебинары по средам с 22 января с 19 до 21 по Москве<br>
        Работаем в zoom</p>

        <h3>Даты очных встреч первого семестра</h3>
        <p>14 - 16 марта 2025<br>
        13 - 15 июня 2025</p>

        <h3>Задачи курса:</h3>
        <p>Ознакомление слушателей с методами, методиками, технологиями и техниками психологического консультирования;<br>
        Овладение психотехническими навыками консультирования;<br>
        Личностное, теоретическое и психотехническое самоопределение психолога-консультанта;<br>
        Начало работы по специальности в условиях поддержки профессионального сообщества.</p>

        <h3>1 семестр. "Личностная идентичность психолога-консультанта"</h3>
        <p>Темы семинаров:<br>
        Введение в профессию<br>
        Психика и ее механизмы<br>
        Сравнительный анализ основных теоретических концепций, используемых в консультировании<br>
        Практика современных школ психологии<br>
        Личностные особенности и мировоззрение психолога-консультанта<br>
        Субъектность и зрелость как основа контакта<br>
        Мир отношений: встреча психолога и клиента</p>

        <h3>2 семестр. "Основы психологического консультирования"</h3>
        <p>Темы семинаров:<br>
        Профессиональное поле и профпозиция консультанта<br>
        Современные методологические подходы в консультировании<br>
        Консультативный контакт<br>
        Базовые навыки консультанта<br>
        Влияние во взаимодействии с клиентом<br>
        Профессиональная идентичность консультанта</p>

        <h3>3 семестр. "Практика психологического консультирования"</h3>
        <p>Темы семинаров:<br>
        Консультативный процесс<br>
        Диагностика в структуре консультативного процесса<br>
        Техники влияния в консультативном процессе (разбор кейсов)<br>
        Процедуры и техники как арсенал работы консультанта<br>
        Трудности в консультировании<br>
        Конструирование техник в процессе работы: индивидуальный подход</p>
        ';

        DB::table('courses')->insert([
            [
                'image_path' => 'images/item-1.png',
                'start_date' => '22 Января 2025, Среда 19:00',
                'format' => 'Очно',
                'description' => 'Авторский курс содержит только самую важную, по нашему мнению, информацию, необходимую для эффективной работы психолога-консультанта. Основная составляющая курса – практическое применение полученных знаний и навыков.',
                'content' => $description,
                'title' => 'БАЗОВЫЙ КУРС ОБУЧЕНИЯ "ПСИХОЛОГИЧЕСКОЕ КОНСУЛЬТИРОВАНИЕ", онлайн-формат',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-2.png',
                'start_date' => '10 Октября 2024, Четверг 19:00',
                'format' => '1 раз в две недели. Очно',
                'description' => 'На мастер-классе планируются учебные сессии в малых группах для студентов-психологов. Где участники смогут поработать со своим переживанием безопасности в клиентской позиции. Тут же применить на практике полученные знания в роли психологов. Получить обратную связь от коллег на свою работу.',
                'content' => $description,
                'title' => 'Мастер-класс "Ресурс безопасности"',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-3.png',
                'start_date' => '10 Октября 2024, Четверг 19:00',
                'format' => 'Онлайн',
                'description' => 'Терапевтическая очная группа "Можно проще, можно больше". Вторая встреча - можно присоединиться',
                'content' => $description,
                'title' => 'Курс: Психотипы в кино.',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-4.png',
                'start_date' => '13 Октября 2024, Воскресенье 19:00',
                'format' => 'Онлайн',
                'description' => 'Эта группа для живых людей, и тех кто хочет ими стать.<br> Темы:<br> - Бытийность (мочь, хотеть, присутствовать, выбирать)<br> - Неврозы (наши любимые: нарциссический лифт, тревожность, одиночество. “Стараться” и жить в постоянной конкуренции)<br> - Психосоматика (когда времени осознавать себя и мир не хватило - и вот, здравствуй, болезнь!)<br>',
                'content' => $description,
                'title' => 'Онлайн-марафон "Я мужчина"',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-5.png',
                'start_date' => '14 Октября 2024, Понедельник',
                'format' => '1 раз в две недели. Очно',
                'description' => 'Мы продолжаем знакомить вас с особенностями Психотипов и начинаем курс «Психотипы в кино», на котором будем смотреть кино и разговаривать об особенностях проявления, целях, смыслах и желаниях каждого из 12 Психотипов.',
                'content' => $description,
                'title' => 'Супервизия для выпускников и коллег',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-6.png',
                'start_date' => '14 Октября 2024, Понедельник 11:00',
                'format' => '1 раз в две недели. Очно',
                'description' => 'В течение недели мы помогаем сформировать первое представление о себе, собрать ресурс для профицита жизни, проработать свои убеждения и барьеры, которые мешают жить и делать свое. Только для мужчин',
                'content' => $description,
                'title' => 'Курс “Работа психолога с темой отношений”',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-7.png',
                'start_date' => '14 Октября 2024, Понедельник 19:00',
                'format' => 'Онлайн',
                'description' => 'Групповая супервизия позволяет получить обратную связь не только от супервизора, но и от психологов с иным стилем и методами работы, рассмотреть случай более объемно. К тому же, в обсуждении разнообразных случаев мы проживаем не только опыт взаимодействия со своими клиентами, но и обогащаемся опытом наших коллег. А также получаем коллегиальную поддержку, что позволяет нам быть более устойчивыми.',
                'content' => $description,
                'title' => 'Специализация "Мотивационное консультирование"',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-8.png',
                'start_date' => '08 Октября 2024, Вторник 19:00',
                'format' => 'Онлайн',
                'description' => 'Курс построен как практическое пособие и включает в себя теорию, техники работы, практику по отработке методов и техник, а также самодиагностику и личную работу. В результате вы получите ваш персональный “мануал”, не только в виде теоретических знаний, но и практического опыта и личного осознавания заявленных тем.',
                'content' => $description,
                'title' => 'Практикум «Работа психолога с символами бессознательного»',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-9.png',
                'start_date' => '15 Октября 2024, Вторник 10:00',
                'format' => 'Очно',
                'description' => 'Для получения приглашения и ссылки заполните форму записи. Если клиент пришёл к психологу - он готов меняться. Многие специалисты считают это аксиомой. Отнюдь. Человек может быть не уверен, что ему необходимо что-то делать, или он пришёл по просьбе другого человека. Он может считать, что ему нужно меняться, но...',
                'content' => $description,
                'title' => 'Практический курс для подростков: «Про отношения. Просто»',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-10.png',
                'start_date' => '18 Октября 2024, Пятница 19:00',
                'format' => 'Очно',
                'description' => 'ВВОДНОЕ ЗАНЯТИЕ В ОНЛАЙН ФОРМАТЕ - 25 СЕНТЯБРЯ С 19:30 ДО 21:30 (без оплаты). Для получения приглашения и ссылки заполните форму записи. Схема-терапия – интегративный подход, разработанный американским психотерапевтом Джефри Янгом в 90-х годах прошлого века, основанный на принципах когнитивно- поведенческой терапии и включающий в себя идеи психоаналитичекой и гештальт-терапии, а также теорию ...',
                'content' => $description,
                'title' => 'Специализация "Основы схема-терапии"',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-11.png',
                'start_date' => '19 Октября 2024, Суббота 12:00',
                'format' => 'Очно',
                'description' => 'Метафорические (они же – ассоциативные, терапевтические, проективные) карты – это наборы картинок, представляющих собой визуальные образы, метафоры для психологической работы в руках профессионального психолога или для самоисследования и помощи самим себе. Иными словами, это богатый, безопасный и творческий инструмент психологической работы.',
                'content' => $description,
                'title' => 'Мастер-класс по работе с метафорическими ассоциативными картами (МАК)',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-12.png',
                'start_date' => '19 Октября 2024, Суббота 11:00',
                'format' => 'Онлайн',
                'description' => 'Этот метод работает не только с семейными проблемами, поле его применения существенно шире. Во время расстановок вы можете работать со всем, что вызывает у вас эмоциональный дискомфорт или затруднения в практическом плане.',
                'content' => $description,
                'title' => 'Системные семейные расстановки',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-13.png',
                'start_date' => '19 Октября 2024, Суббота 11:00',
                'format' => 'Очно',
                'description' => 'Курс доступен для прошедших семинар "Самоценность" Создан для развития ключевых психологических навыков. Разобраться и навести порядок в своем отношении с основными психологическими категориями, которые встречаются жизни каждого человека. Это швейцарский нож (психологический мультитул), где есть все необходимые инструменты для решения психологических проблем',
                'content' => $description,
                'title' => 'Базовый курс повышения психологической компетентности soft skills, 1 ступень',
                'created_at' => now(),
                'updated_at' => now(),
            ],
        ]);
    }
}
