<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CoursesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $description = '<h3>Обучение в очно-заочной группе начинается с Вводного курса.</h3>
        <p>Данный курс входит в стоимость 1 семестра и включает в себя решение следующих задач:<br>
        - знакомство с преподавателями;<br>
        - понимание нашего мировоззрения и соотнесение со своим;<br>
        - интересный и необходимый обучающий материал для вхождения в профессию;<br>
        - ваше понимание по усвоению материала (после лекции есть ли интерес слушать дальше, понятна ли информация, осталось ли что то из услышанного внутри...)</p>
        <p>К вводному курсу можно приступить прямо сейчас. Помимо лекций, он включает в себя 2 онлайн вебинара</p>

        <h3>Старт обучения с онлайн блока</h3>
        <p>Вебинары по средам с 22 января с 19 до 21 по Москве<br>
        Работаем в zoom</p>

        <h3>Даты очных встреч первого семестра</h3>
        <p>14 - 16 марта 2025<br>
        13 - 15 июня 2025</p>

        <h3>Задачи курса:</h3>
        <p>Ознакомление слушателей с методами, методиками, технологиями и техниками психологического консультирования;<br>
        Овладение психотехническими навыками консультирования;<br>
        Личностное, теоретическое и психотехническое самоопределение психолога-консультанта;<br>
        Начало работы по специальности в условиях поддержки профессионального сообщества.</p>

        <h3>1 семестр. "Личностная идентичность психолога-консультанта"</h3>
        <p>Темы семинаров:<br>
        Введение в профессию<br>
        Психика и ее механизмы<br>
        Сравнительный анализ основных теоретических концепций, используемых в консультировании<br>
        Практика современных школ психологии<br>
        Личностные особенности и мировоззрение психолога-консультанта<br>
        Субъектность и зрелость как основа контакта<br>
        Мир отношений: встреча психолога и клиента</p>

        <h3>2 семестр. "Основы психологического консультирования"</h3>
        <p>Темы семинаров:<br>
        Профессиональное поле и профпозиция консультанта<br>
        Современные методологические подходы в консультировании<br>
        Консультативный контакт<br>
        Базовые навыки консультанта<br>
        Влияние во взаимодействии с клиентом<br>
        Профессиональная идентичность консультанта</p>

        <h3>3 семестр. "Практика психологического консультирования"</h3>
        <p>Темы семинаров:<br>
        Консультативный процесс<br>
        Диагностика в структуре консультативного процесса<br>
        Техники влияния в консультативном процессе (разбор кейсов)<br>
        Процедуры и техники как арсенал работы консультанта<br>
        Трудности в консультировании<br>
        Конструирование техник в процессе работы: индивидуальный подход</p>
        ';

        $price = '<p>Стоимость: за семестр: единый платеж 80 000 рублей.</p>
        <p>Двумя частями - 84 000 рублей (по 42 000 рублей). </p>
        <p>Тремя частями - 87 рублей (по 29 000 рублей) </p>
        <p>Всего 3 семестра. </p>
        <p>По всем вопросам, куратор онлайн программ МПЛ12, 7 925 506 17 12, Татьяна</p>';

        $reviews = '<p>Очень люблю «Понедельник начинается в субботу» братьев Стругацких. Там описан мир, в котором есть что-то от детства - близкое и очень доброе.</p>
        <p>Особенно нравится вот это место:<br>
        «…сюда в двенадцать часов новогодней ночи, прорвавшись через пургу, пришли люди, которым было интереснее доводить до конца или начинать сызнова какое-нибудь полезное дело, чем глушить себя водкою, бессмысленно дрыгать ногами, играть в фанты и заниматься флиртом разных степеней лёгкости. Сюда пришли люди, которым было приятнее быть друг с другом, чем порознь, которые терпеть не могли всякого рода воскресений, потому что в воскресенье им было скучно...<br>
        Они работали в институте, который занимался, прежде всего, проблемами человеческого счастья и смысла человеческой жизни, но даже среди них никто точно не знал, что такое счастье и в чём именно смысл жизни. И они приняли рабочую гипотезу, что счастье в непрерывном познании неизвестного и смысл жизни в том же.<br>
        Каждый человек – маг в душе, но он становится магом только тогда, когда начинает меньше думать о себе и больше о других, когда работать ему становится интереснее, чем развлекаться в старинном смысле этого слова…»</p>

        <p>Такой мир я встретила в Московской Психологической Лаборатории 12. Я там училась и мне повезло.</p>
        <p>Психологи. Живые, разные, нестандартные, упрямые в своем стремлении докопаться до сути… Люди, которые страстно увлечены делом, ставят поиск правды выше личных интересов и любых амбиций. Там нет иерархии и формализма.<br>
        Опытный психолог живо и на равных спорит со студентом и с радостью открывает новое для себя. Там ценится настоящее и живое в человеке…</p>

        <p>Именно в МПЛ12 я полюбила психологию и узнала, что такое учитель, который обучает не словами, а своей жизнью, своим отношением к другим, своей любовью к работе.</p>
        <p>Юлия Зотова, Арман Бекенов – спасибо!<br>
        Друзья, я знаю, что некоторые интересовались, где освоить профессию психолога.<br>
        Вот, рекомендую, уже скоро :)<br>
        Там есть то, что не так часто встречается в других местах: постоянная практика, этичность, увлеченные профессионалы, любовь к психологии и дружеская поддержка...</p>
        ';

        DB::table('courses')->insert([
            [
                'image_path' => 'images/item-1.png',
                'start_date' => '22 Января 2025, Среда 19:00',
                'format' => 'Очно',
                'description' => 'Авторский курс содержит только самую важную, по нашему мнению, информацию, необходимую для эффективной работы психолога-консультанта. Основная составляющая курса – практическое применение полученных знаний и навыков.',
                'content' => $description,
                'title' => 'БАЗОВЫЙ КУРС ОБУЧЕНИЯ "ПСИХОЛОГИЧЕСКОЕ КОНСУЛЬТИРОВАНИЕ", онлайн-формат',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => true,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-2.png',
                'start_date' => '10 Октября 2024, Четверг 19:00',
                'format' => '1 раз в две недели. Очно',
                'description' => 'На мастер-классе планируются учебные сессии в малых группах для студентов-психологов. Где участники смогут поработать со своим переживанием безопасности в клиентской позиции. Тут же применить на практике полученные знания в роли психологов. Получить обратную связь от коллег на свою работу.',
                'content' => $description,
                'title' => 'Мастер-класс "Ресурс безопасности"',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => true,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-3.png',
                'start_date' => '10 Октября 2024, Четверг 19:00',
                'format' => 'Онлайн',
                'description' => 'Терапевтическая очная группа "Можно проще, можно больше". Вторая встреча - можно присоединиться',
                'content' => $description,
                'title' => 'Курс: Психотипы в кино.',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => false,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-4.png',
                'start_date' => '13 Октября 2024, Воскресенье 19:00',
                'format' => 'Онлайн',
                'description' => 'Эта группа для живых людей, и тех кто хочет ими стать.<br> Темы:<br> - Бытийность (мочь, хотеть, присутствовать, выбирать)<br> - Неврозы (наши любимые: нарциссический лифт, тревожность, одиночество. “Стараться” и жить в постоянной конкуренции)<br> - Психосоматика (когда времени осознавать себя и мир не хватило - и вот, здравствуй, болезнь!)<br>',
                'content' => $description,
                'title' => 'Онлайн-марафон "Я мужчина"',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => true,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-5.png',
                'start_date' => '14 Октября 2024, Понедельник',
                'format' => '1 раз в две недели. Очно',
                'description' => 'Мы продолжаем знакомить вас с особенностями Психотипов и начинаем курс «Психотипы в кино», на котором будем смотреть кино и разговаривать об особенностях проявления, целях, смыслах и желаниях каждого из 12 Психотипов.',
                'content' => $description,
                'title' => 'Супервизия для выпускников и коллег',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => false,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-6.png',
                'start_date' => '14 Октября 2024, Понедельник 11:00',
                'format' => '1 раз в две недели. Очно',
                'description' => 'В течение недели мы помогаем сформировать первое представление о себе, собрать ресурс для профицита жизни, проработать свои убеждения и барьеры, которые мешают жить и делать свое. Только для мужчин',
                'content' => $description,
                'title' => 'Курс “Работа психолога с темой отношений”',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => true,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-7.png',
                'start_date' => '14 Октября 2024, Понедельник 19:00',
                'format' => 'Онлайн',
                'description' => 'Групповая супервизия позволяет получить обратную связь не только от супервизора, но и от психологов с иным стилем и методами работы, рассмотреть случай более объемно. К тому же, в обсуждении разнообразных случаев мы проживаем не только опыт взаимодействия со своими клиентами, но и обогащаемся опытом наших коллег. А также получаем коллегиальную поддержку, что позволяет нам быть более устойчивыми.',
                'content' => $description,
                'title' => 'Специализация "Мотивационное консультирование"',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => false,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-8.png',
                'start_date' => '08 Октября 2024, Вторник 19:00',
                'format' => 'Онлайн',
                'description' => 'Курс построен как практическое пособие и включает в себя теорию, техники работы, практику по отработке методов и техник, а также самодиагностику и личную работу. В результате вы получите ваш персональный “мануал”, не только в виде теоретических знаний, но и практического опыта и личного осознавания заявленных тем.',
                'content' => $description,
                'title' => 'Практикум «Работа психолога с символами бессознательного»',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => true,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-9.png',
                'start_date' => '15 Октября 2024, Вторник 10:00',
                'format' => 'Очно',
                'description' => 'Для получения приглашения и ссылки заполните форму записи. Если клиент пришёл к психологу - он готов меняться. Многие специалисты считают это аксиомой. Отнюдь. Человек может быть не уверен, что ему необходимо что-то делать, или он пришёл по просьбе другого человека. Он может считать, что ему нужно меняться, но...',
                'content' => $description,
                'title' => 'Практический курс для подростков: «Про отношения. Просто»',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => false,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-10.png',
                'start_date' => '18 Октября 2024, Пятница 19:00',
                'format' => 'Очно',
                'description' => 'ВВОДНОЕ ЗАНЯТИЕ В ОНЛАЙН ФОРМАТЕ - 25 СЕНТЯБРЯ С 19:30 ДО 21:30 (без оплаты). Для получения приглашения и ссылки заполните форму записи. Схема-терапия – интегративный подход, разработанный американским психотерапевтом Джефри Янгом в 90-х годах прошлого века, основанный на принципах когнитивно- поведенческой терапии и включающий в себя идеи психоаналитичекой и гештальт-терапии, а также теорию ...',
                'content' => $description,
                'title' => 'Специализация "Основы схема-терапии"',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => true,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-11.png',
                'start_date' => '19 Октября 2024, Суббота 12:00',
                'format' => 'Очно',
                'description' => 'Метафорические (они же – ассоциативные, терапевтические, проективные) карты – это наборы картинок, представляющих собой визуальные образы, метафоры для психологической работы в руках профессионального психолога или для самоисследования и помощи самим себе. Иными словами, это богатый, безопасный и творческий инструмент психологической работы.',
                'content' => $description,
                'title' => 'Мастер-класс по работе с метафорическими ассоциативными картами (МАК)',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => false,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-12.png',
                'start_date' => '19 Октября 2024, Суббота 11:00',
                'format' => 'Онлайн',
                'description' => 'Этот метод работает не только с семейными проблемами, поле его применения существенно шире. Во время расстановок вы можете работать со всем, что вызывает у вас эмоциональный дискомфорт или затруднения в практическом плане.',
                'content' => $description,
                'title' => 'Системные семейные расстановки',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => false,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'image_path' => 'images/item-13.png',
                'start_date' => '19 Октября 2024, Суббота 11:00',
                'format' => 'Очно',
                'description' => 'Курс доступен для прошедших семинар "Самоценность" Создан для развития ключевых психологических навыков. Разобраться и навести порядок в своем отношении с основными психологическими категориями, которые встречаются жизни каждого человека. Это швейцарский нож (психологический мультитул), где есть все необходимые инструменты для решения психологических проблем',
                'content' => $description,
                'title' => 'Базовый курс повышения психологической компетентности soft skills, 1 ступень',
                'price' => $price,
                'reviews' => $reviews,
                'is_video' => false,
                'created_at' => now(),
                'updated_at' => now(),
            ],
        ]);
    }
}
