<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\GeneralInfo;

class GeneralInfoSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        if (GeneralInfo::count() == 0) {
            GeneralInfo::create([
                'menu_names' => json_encode([
                    'Обучение: базовый курс онлайн',
                    'Видео курсы',
                    'SOFT SKILLS Навыки жизни',
                    'Супервизия',
                    'Контакты',
                    'Текущие мероприятия. Уже стартовали',
                    'Команда психологов МПЛ12',
                    'Доступная помощь. Выпускники МПЛ 12',
                    'Видео'
                ]),
                'address' => 'Новая Басманная 23б с20',
                'whatsapp' => '+79255061712',
                'youtube' => 'https://www.youtube.com/channel/UCziWIpu0l18DX8aqu4_xEVg',
                'vk' => 'https://vk.com/mpl12',
                'telegram_channel' => 'https://t.me/mpl_12',
                'telegram_group' => 'https://t.me/mpl_12',
                'format' => [
                    '1 вечер очно',
                    '1 встреча раз в месяц, очно',
                    '1 и 7 семинар очно по выходным с 11 до 19, со 2го по 6й семинары – онлайн',
                    '1 раз в две недели с 19:30 до 23:00, очно',
                    '1 раз в две недели, дневная форма обучения',
                    '1 раз в две недели, очно',
                    '10 вечеров раз в неделю',
                    '10 встреч в онлайн-формате',
                    '12 вечеров раз в неделю, очно',
                    '12 встреч, очно',
                    '12 семинаров с периодичностью раз в две недели',
                    '2 вечера раз в неделю, очно',
                    '2 встречи в онлайн-формате',
                    '2 встречи раз в неделю, очно',
                    '2 раза в неделю по будням с 10 до 14+двухдневки с 10 до 18',
                    '2 раза в неделю по будням с 19 до 23+двухдневки с 11 до 19 по выходным',
                    '3 вечера раз в неделю, очно',
                    '3 встречи в онлайн-формате',
                    '3 встречи раз в неделю, очно',
                    '4 вечера раз в неделю, очно',
                    '4 вечера раз в неделю, очно',
                    '4 встречи в онлайн-формате',
                    '5 вечеров раз в неделю, очно',
                    '5 встреч в онлайн-формате',
                    '5 двухдневных семинаров с 11:00 до 19:00',
                    '6 вечеров раз в неделю, очно',
                    '6 встреч в онлайн-формате',
                    '6 встреч раз в неделю, очно',
                    '6 двухдневных семинаров с 10.00 до 18.00',
                    '6 двухдневных семинаров с 10.30 до 18.30',
                    '6 двухдневных семинаров с 11:00 до 19:00',
                    '6 двухдневных семинаров с 11:00 до 19:00 в онлайн-формате',
                    '6 двухдневных семинаров с 12.00 до 19.00',
                    '7 вечеров раз в неделю, очно',
                    '7 двухдневных семинаров с 11.00 до 19.00',
                    '8 вечеров раз в неделю, очно',
                    '8 встреч в онлайн-формате',
                    '9 вечеров раз в неделю, очно',
                    '9 встреч, очно',
                    '9 двухдневных семинаров с 11.00 до 19.00',
                    'Выездной тренинг, 3 дня и 2 ночи',
                    'Недельный интенсив',
                    'Онлайн',
                    'Разовая встреча, очно',
                    'Собеседование',
                    'Суббота и воскресенье с 11:00 до 18:00',
                    'Суббота и воскресенье с 11:00 до 19:00',
                ],
            ]);
        }
    }
}
