<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PsychologistSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $education = '<h3>Психолог-консультант и врач-психотерапевт, работаю с 2004 года. Автор книг об эмоциях, фобиях, панических атаках и книг для родителей.</h3>
        <p>Чаще всего ко мне обращаются, чтобы:<br>
        – поднять самооценку, научиться себя любить,<br>
        – разобраться с эмоциями (страхи, паника, раздражительность, горе, ревность и другие),<br>
        – улучшить отношения с партнером или детьми.</p>

        <h3>В своей работе я в основном использую краткосрочные проблемно-ориентированные методы, психодраму (монодраму) и телесно-ориентированную терапию.</h3>

        <h3>Образование:</h3>
        <p>Врач-психотерапевт (ИГМУ, 2003),<br>
        Психолог-консультант (ИПКРО, 2004),<br>
        Психолог-консультант (НИИСПиПРЛ, 2010).</p>

        <h3>Специализации:</h3>
        <p>Сказкотерапия (НИИСПиПРЛ, 2010),<br>
        Работа психолога-консультанта с психической травмой (МПЛ12, 2013),<br>
        Введение в психодраму (МИГиП, 2013),<br>
        Психотерапия психосоматических расстройств (АТОП, 2014),<br>
        Гештальт и психодрама: Краски жизни (НОЧУ «ИГиП», 2016),<br>
        Комплексный подход в работе с психологической травмой и кризисными состояниями (НП ВПО «ИМСГС», 2016),<br>
        Базовый курс психодрамы (МИГиП, РАП, 2016),<br>
        и еще множество других тренингов и программ.</p>
        ';

        DB::table('psychologists')->insert([
            [
                'name' => 'Александр Мусихин',
                'main_image_path' => 'images/teacher-1.png',
                'quote' => 'Я искренне считаю, что основная задача психотерапии – помочь человеку научиться любить себя безусловно. Это включает и бережное отношение к себе, и умение себя защищать, и умение себя организовать, и вовремя о себе позаботиться, и вовремя включить волю, и еще многое другое. Это как найти внутри себя бесконечный источник ресурсов, который не зависит от других людей, обстоятельств жизни и который навсегда останется с вами.',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Марина Уланова',
                'main_image_path' => 'images/teacher-2.png',
                'quote' => 'Я люблю помогать людям реализовывать их мечты и желания, быть сопричастной к изменению и самореализации. Я телесно-ориентированный…',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Мария Летучева',
                'main_image_path' => null,
                'quote' => 'Психолог с гуманистическим мировоззрением и, надеюсь, с большим запасом здравомыслия, несмотря на всю трепетность своего ремесла. В своей работе использую методики поведенческой, телесной, арт-терапии, психодрамы,   системной семейной терапии. Словом, беру всё, что работает и помогает людям становиться более живыми и настоящими, получать удовольствие от своей работы, увлечений, в контакте с близкими людьми. Психолог-консультант, преподаватель,…',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Наталья Белова',
                'main_image_path' => null,
                'quote' => 'Тебе важен путь к СЕБЕ? Тогда нам по пути. Помогаю осознавать свои возможности и ограничения и во всём уметь опираться на себя. На опыте знаю, что для реализации любых высот нужна лишь четко сформулированная цель и желание ее достигнуть.',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Светлана Дубровина',
                'main_image_path' => null,
                'quote' => 'Я верю, что истинная ценность для человека - в познании себя. Для меня важно помочь найти свой путь и сопроводить человека в процессе обретения смысла. Частно практикующий аналитик, психотерапевт…',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Марианна Шипицына',
                'main_image_path' => null,
                'quote' => 'Кто я? Что у меня есть? Что я могу? Чего я хочу? Как это получить? И что с этим делать? Если есть вопрос – всегда есть и ответ. Если есть желания –всегда есть возможности. Если есть проблема – всегда есть решение.',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Ирина Андреева-Чадаева',
                'main_image_path' => 'images/teacher-3.png',
                'quote' => 'Эффективно и с любовью сказать жизни «Да».',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Анастасия Бадаева',
                'main_image_path' => 'images/teacher-4.png',
                'quote' => 'С уважением и бережностью отношусь к уникальности и индивидуальности каждого человека, искренне верю в возможность изменений и разрешения любой ситуации, имею большой опыт эффективной работы с клиентами по самым разным темам.',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Татьяна Князева',
                'main_image_path' => 'images/teacher-5.png',
                'quote' => 'Стать автором своей жизни возможно в любом возрасте! Если вы оказались в сложной жизненной…',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Светлана Дубровина',
                'main_image_path' => null,
                'quote' => 'Я верю, что истинная ценность для человека - в познании себя. Для меня важно помочь найти свой путь и сопроводить человека в процессе обретения смысла. Частно практикующий аналитик, психотерапевт…',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Марианна Шипицына',
                'main_image_path' => null,
                'quote' => 'Кто я? Что у меня есть? Что я могу? Чего я хочу? Как это получить? И что с этим делать? Если есть вопрос – всегда есть и ответ. Если есть желания –всегда есть возможности. Если есть проблема – всегда есть решение.',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Ирина Андреева-Чадаева',
                'main_image_path' => 'images/teacher-3.png',
                'quote' => 'Эффективно и с любовью сказать жизни «Да».',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Анастасия Бадаева',
                'main_image_path' => 'images/teacher-4.png',
                'quote' => 'С уважением и бережностью отношусь к уникальности и индивидуальности каждого человека, искренне верю в возможность изменений и разрешения любой ситуации, имею большой опыт эффективной работы с клиентами по самым разным темам.',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'Татьяна Князева',
                'main_image_path' => 'images/teacher-5.png',
                'quote' => 'Стать автором своей жизни возможно в любом возрасте! Если вы оказались в сложной жизненной…',
                'education' => $education,
                'created_at' => now(),
                'updated_at' => now(),
            ]
        ]);
    }
}
