<?php

namespace Database\Factories;

use App\Models\Course;
use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Course>
 */
class CourseFactory extends Factory
{
    protected $model = Course::class;
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {
        $description = '<h3>Обучение в очно-заочной группе начинается с Вводного курса.</h3>
        <p>Данный курс входит в стоимость 1 семестра и включает в себя решение следующих задач:<br>
        - знакомство с преподавателями;<br>
        - понимание нашего мировоззрения и соотнесение со своим;<br>
        - интересный и необходимый обучающий материал для вхождения в профессию;<br>
        - ваше понимание по усвоению материала (после лекции есть ли интерес слушать дальше, понятна ли информация, осталось ли что то из услышанного внутри...)</p>
        <p>К вводному курсу можно приступить прямо сейчас. Помимо лекций, он включает в себя 2 онлайн вебинара</p>

        <h3>Старт обучения с онлайн блока</h3>
        <p>Вебинары по средам с 22 января с 19 до 21 по Москве<br>
        Работаем в zoom</p>

        <h3>Даты очных встреч первого семестра</h3>
        <p>14 - 16 марта 2025<br>
        13 - 15 июня 2025</p>

        <h3>Задачи курса:</h3>
        <p>Ознакомление слушателей с методами, методиками, технологиями и техниками психологического консультирования;<br>
        Овладение психотехническими навыками консультирования;<br>
        Личностное, теоретическое и психотехническое самоопределение психолога-консультанта;<br>
        Начало работы по специальности в условиях поддержки профессионального сообщества.</p>

        <h3>1 семестр. "Личностная идентичность психолога-консультанта"</h3>
        <p>Темы семинаров:<br>
        Введение в профессию<br>
        Психика и ее механизмы<br>
        Сравнительный анализ основных теоретических концепций, используемых в консультировании<br>
        Практика современных школ психологии<br>
        Личностные особенности и мировоззрение психолога-консультанта<br>
        Субъектность и зрелость как основа контакта<br>
        Мир отношений: встреча психолога и клиента</p>

        <h3>2 семестр. "Основы психологического консультирования"</h3>
        <p>Темы семинаров:<br>
        Профессиональное поле и профпозиция консультанта<br>
        Современные методологические подходы в консультировании<br>
        Консультативный контакт<br>
        Базовые навыки консультанта<br>
        Влияние во взаимодействии с клиентом<br>
        Профессиональная идентичность консультанта</p>

        <h3>3 семестр. "Практика психологического консультирования"</h3>
        <p>Темы семинаров:<br>
        Консультативный процесс<br>
        Диагностика в структуре консультативного процесса<br>
        Техники влияния в консультативном процессе (разбор кейсов)<br>
        Процедуры и техники как арсенал работы консультанта<br>
        Трудности в консультировании<br>
        Конструирование техник в процессе работы: индивидуальный подход</p>
        ';

        $price = '<p>Стоимость: за семестр: единый платеж 80 000 рублей.</p>
        <p>Двумя частями - 84 000 рублей (по 42 000 рублей). </p>
        <p>Тремя частями - 87 рублей (по 29 000 рублей) </p>
        <p>Всего 3 семестра. </p>
        <p>По всем вопросам, куратор онлайн программ МПЛ12, 7 925 506 17 12, Татьяна</p>';

        $reviews = '<p>Очень люблю «Понедельник начинается в субботу» братьев Стругацких. Там описан мир, в котором есть что-то от детства - близкое и очень доброе.</p>
        <p>Особенно нравится вот это место:<br>
        «…сюда в двенадцать часов новогодней ночи, прорвавшись через пургу, пришли люди, которым было интереснее доводить до конца или начинать сызнова какое-нибудь полезное дело, чем глушить себя водкою, бессмысленно дрыгать ногами, играть в фанты и заниматься флиртом разных степеней лёгкости. Сюда пришли люди, которым было приятнее быть друг с другом, чем порознь, которые терпеть не могли всякого рода воскресений, потому что в воскресенье им было скучно...<br>
        Они работали в институте, который занимался, прежде всего, проблемами человеческого счастья и смысла человеческой жизни, но даже среди них никто точно не знал, что такое счастье и в чём именно смысл жизни. И они приняли рабочую гипотезу, что счастье в непрерывном познании неизвестного и смысл жизни в том же.<br>
        Каждый человек – маг в душе, но он становится магом только тогда, когда начинает меньше думать о себе и больше о других, когда работать ему становится интереснее, чем развлекаться в старинном смысле этого слова…»</p>

        <p>Такой мир я встретила в Московской Психологической Лаборатории 12. Я там училась и мне повезло.</p>
        <p>Психологи. Живые, разные, нестандартные, упрямые в своем стремлении докопаться до сути… Люди, которые страстно увлечены делом, ставят поиск правды выше личных интересов и любых амбиций. Там нет иерархии и формализма.<br>
        Опытный психолог живо и на равных спорит со студентом и с радостью открывает новое для себя. Там ценится настоящее и живое в человеке…</p>

        <p>Именно в МПЛ12 я полюбила психологию и узнала, что такое учитель, который обучает не словами, а своей жизнью, своим отношением к другим, своей любовью к работе.</p>
        <p>Юлия Зотова, Арман Бекенов – спасибо!<br>
        Друзья, я знаю, что некоторые интересовались, где освоить профессию психолога.<br>
        Вот, рекомендую, уже скоро :)<br>
        Там есть то, что не так часто встречается в других местах: постоянная практика, этичность, увлеченные профессионалы, любовь к психологии и дружеская поддержка...</p>
        ';

        $faker = \Faker\Factory::create('ru_RU');

        return [
            'image_path' => collect(glob(storage_path('app/public/courses/*.*')))
            ->map(fn($path) => 'courses/' . basename($path))
            ->random(),
            'start_date' => fake()->date(),
            'start_time' => fake()->time('H:i'),
            'category' =>  $this->faker->randomElement(['Для специалистов и студентов', 'Тренинги', 'Подросткам и родителям', 'Супервизии']),
            'format' => 'Очно',
            'description' => 'Авторский курс содержит только самую важную, по нашему мнению, информацию, необходимую для эффективной работы психолога-консультанта. Основная составляющая курса – практическое применение полученных знаний и навыков.',
            'content' => $description,
            'title' => $faker->sentence(),
            'price' => $price,
            'reviews' => $reviews,
            'created_at' => now(),
            'updated_at' => now(),
        ];
    }
}
